HELP_MESSAGE = "| /a | Добавить текущий сервер в список избранного. | \n\
| /n NICKNAME | Сменить ник на NICKNAME. | \n\
| /p TARGET TEXT | Отправить персональное сообщение (TEXT) пользователю, каналу или сервис-боту (TARGET). |\n\
| /s HOSTNAME [PORT] | Подключиться к серверу с указанными HOSTNAME и PORT (по умолчанию 6667). |\n\
| /d | Отключиться от сервера. |\n\
| /c CODEPAGE| Изменить текущую кодировку на CODEPAGE. |\n\
| /f | Показать список избранных серверов. |\n\
| /n | Вывести список пользователей на активном канале. |\n\
| /l| Вывести список всех каналов на сервере. |\n\
| /j CHANNEL | Присоединиться к каналу CHANNEL (не должны быть уже присоединены к нему). |\n\
| /lv | Покинуть активный канал. |\n\
| /sw CHANNEL | Переключить активный канал на CHANNEL (должны быть присоединены к нему). |\n\
| /e | Выход из приложения. |"

CONFIG_PATH = "conf.ini"

BUFFER_SIZE = 4096

CODE_PAGES = {"cp1251", "koi8_r", "cp866", "mac_cyrillic", "iso8859_5"}